Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Companies can use this checklist as a confidential internal tool to assess their progress in implementing a rigorous compliance process and help them prioritize their process improvement efforts.
ja: 企業は、このチェックリストを社内ツールとして使用することにより、コンプライアンス プロセス実装の進捗状況を評価したり、プロセス改善活動の優先順位を決定したりすることができます。

source: Mandate engineers to take the FOSS training by a specific date.
ja: 指定日までに技術者に FOSS トレーニングを受講させる。

source: Adaptation of existing processes
ja: 既存のプロセスの適応

source: Obligation Satisfaction
ja: 義務の履行

source: August 2010
ja: 2010 年 8 月

source: Licenses are not negotiated; they are imposed
ja: ライセンスは交渉されるのではなく、課せられる

source: Consequences of non-compliance
ja: コンプライアンス不履行が招く結末

source: a)The OSRB is staffed with appropriately skilled and knowledgeable individuals.
ja: a) OSRB は、適切なスキルと知識を持った人々で構成されていること。

source: Build System Requirements
ja: ビルド システムの要件

source: Building a relation with the FOSS community and FOSS organization through involvement with FOSS projects and participation in FOSS events
ja: FOSS プロジェクトへの関わりや、FOSS イベントへの参加を通して、FOSS コミュニティと FOSS 組織の関係を構築できる

source: Half-Day
ja: 半日

source: This gives end users the confidence that a binary package has not accidentally or intentionally been corrupted or manipulated after it was built.
ja: 署名されていることによって、エンド ユーザーは、ビルド後のバイナリ パッケージが偶然にも意図的にも破損されていないことを確信できます。

source: Table 2 provides examples of tools that can be used by a FOSS compliance program:
ja: 表 2 は、FOSS コンプライアンス プログラムによって使用できるツールの例です。

source: Open Compliance Program Information
ja: オープン コンプライアンス プログラムの資料

source: Elements of an End-to-End Compliance Process
ja: コンプライアンス プロセスの要素

source: In this whitepaper, we will provide a definition of a build system, an overview over common requirements a build system has to fulfill and a walk through the typical build and packaging process for Linux distributions and their software packages.
ja: このホワイトペーパーでは、まず、ビルド システムの定義、ビルド システムが満たすべき一般的要件、Linux ディストリビューションとそのソフトウェア パッケージに関する典型的なビルド/パッケージング プロセスの概要などを説明します。

source: Course material also covers additional resources available from The Linux Foundation to assist in implementing a compliance program, including training and white papers, open source compliance tools, self-assessment checklist, and community forum.
ja: そのほか、トレーニング、ホワイトペーパー、オープン ソース コンプライアンス ツール、自己診断チェックリスト、コミュニティ フォーラムなど、The Linux Foundation がコンプライアンス プログラムの実行に役立つよう提供しているリソースについてもカバーしています。

source: The Open Compliance Program stands ready and able to assist in these endeavors.
ja: オープン コンプライアンス プログラムは、このような試みに対応するよう作成されています。

source: ii)Appropriate oversight, review, and approval of compliance actions is provided.
ja: ii) コンプライアンスに関する適切な監督、調査、および承認作業が実施されていること。

source: As the use of Linux and other open source software has exploded in recent years, especially in mobile and consumer electronics products, the need has arisen for a trusted, neutral, non-commercial compliance program that offers a comprehensive offering of compliance training, tools and services.
ja: 近年、モバイルや家電製品を中心に Linux などのオープン ソース ソフトウェアの利用が増えています。このため、コンプライアンスに関するトレーニング、ツール、サービスなどを包括的に提供できる、中立で信頼性のある非商用コンプライアンス プログラムの必要性が高まっています。

source: - OSEC (Open Source Executive Committee)
ja: OSEC (オープン ソース エグゼクティブ委員会)

source: For more information, see
ja: 詳細については、下記のページをご覧ください。

source: As part of the approval step in the compliance process, there are two main recommended practices:
ja: コンプライアンス プロセスの承認ステップには、2 つの主要な推奨プラクティスがあります。

source: OBS supports many users to collaborate effectively and work concurrently on the same Projects.
ja: OBS は、多くのユーザーが効果的に協力でき、同じプロジェクトに同時に取り組めるように支援します。

source: Proprietary +
ja: プロプライエタリ +

source: The checklist will have no legal status or binding effect.
ja: チェックリストには法的資格や拘束力はありません。

source: Responding to compliance inquiries
ja: コンプライアンスに関する照会への対応

source: - Integrate compliance practices in the software development process
ja: ソフトウェア開発プロセスにコンプライアンス プラクティスを組み込む

source: The translations must be labeled as unofficial to inform people that they do not count legally as substitutes for the authentic version
ja: その翻訳版が非公式であること明示し、その翻訳版が法的には正式版の代替とみなされないことを人々に伝えること

source: Registration Phase
ja: 登録フェーズ

source: Now that a secure Operating System boot loader is installed with a signature which is validated it will be the job of the boot loader to validate and run the operating system, which it will presumably do by a similar signature means.
ja: セキュアな OS ブート ローダーは、有効な署名を伴ってインストールされると、OS を認証および実行するための処理を開始します。これらも、署名を用いた同様の方法で実行されます。

source: MeeGo will be deployed across many computing device types - including pocketable mobile computers, netbooks, tablets, mediaphones, connected TVs and in-vehicle infotainment systems, and brings together the leaders in computing and mobile communications as the project's backers.
ja: MeeGo は、携帯モバイル コンピューター、ネットブック、タブレット、メディアフォン、インターネット テレビ、車載インフォテインメントなどのさまざまなコンピューター機器に利用可能であり、コンピューティングやモバイル通信分野のリーダーの支持を集めています。

source: Tools are used to track OSS issues to closure.
ja: OSS 問題をクローズまで追跡するために、ツールが使用されている。

source: The scheduler keeps track of the running jobs and can parallelize the task for faster processing if the FOSSology installation has been configured for multiple hosts.
ja: スケジューラーは実行するジョブを記録し、FOSSology のインストールが複数のホストに対して構成されている場合は、より高速な処理を行うためにタスクを並列処理します。◆◆

source: Getting involved in MeeGo is as easy as visiting MeeGo.com.
ja: MeeGo に参加したい方は、MeeGo.com をご覧ください。

source: There exist several side benefits to achieving compliance that includes:
ja: コンプライアンスを実現することにより、次のようなメリットがあります。

source: If a new version of this software component is available, engineering teams need to go through the process again to get approval for using the new version.
ja: この FOSS ソフトウェア コンポーネントの新バージョンが利用可能になった場合は、エンジニアリング チームは、再度同じプロセスを経て、その新バージョンの使用について承認を受ける必要があります。

source: EXAMPLES OF COMPLIANCE FAILURES AND HOW TO AVOID THEM
ja: コンプライアンス違反とその回避方法の例

source: The focus of the course will be on compliance practices and techniques adopted by the company to allow you to ship a product containing FOSS while meeting all license obligations, without putting the Company's intellectual property or that of your third party software providers at risk.
ja: このコースでは、企業によるコンプライアンス活動とテクニックを主に取り上げ、ライセンス義務に従い、しかも企業の知的財産やサード パーティ ソフトウェア プロバイダーの知的財産を危険にさらすことなく、FOSS を含む製品を出荷できるようにします。

source: Publisher
ja: パブリッシャー

source: Unplanned or unapproved inclusion of FOSS into proprietary or 3rd party code or vice versa (i.e. failure to submit an Open Source Review Board (OSRB) request form):
ja: プロプライエタリまたはサード パーティのコードに予期せぬまたは未承認の内包物があった、またはその逆(すなわち、社内の OSRB (オープンソース調査委員会: Open Source Review Board) に申請書を提出していなかった)。

source: A build system seeks to automate the typical steps of creating a software package from source code to the executable potentially including other files such as binary libraries, resource files, etc.
ja: ビルド システムというのは、バイナリ ライブラリやリソース ファイルなども含めて、ソース コードから実行ファイルにするまでの一般的なソフトウェア パッケージ作成ステップを自動化するものです。

source: Review Phase
ja: 調査フェーズ

source: The compliance program provides a structure around all aspects of FOSS including selection, approval, use, distribution, audit, inventory, training, community engagement, and public communication.
ja: コンプライアンス プログラムは、選択、承認、使用、配布、監査、インベントリー、トレーニング、コミュニティとの関わり、パブリック コミュニケーションなど、FOSS のすべての面を取り巻く構造を提供します。コンプライアンス プログラムは、選択、承認、使用、配布、監査、インベントリー、トレーニング、コミュニティとの関わ り、パブリック コミュニケーションなど、FOSS のすべての面を取り巻く構造を提供します。

source: Once Engineering confirms that the issue has been resolved, it is highly recommended to re-do the linkage analysis to verify that the code changes introduced by Engineering have in fact resolved the linkage issue without introducing new issues.
ja: 技術担当者は、問題の解決を確認後、リンク解析を再実行し、自身が行ったコード変更が実際に新たな問題を起こすことなくリンク問題を解決したことを必ず確認してください。

source: The organization assures that its third party suppliers provide all information that is necessary to satisfy OSS obligations when the product is distributed, e.g. copyright notices and attributions, license text, corresponding source code that must be made available, etc.
ja: 組織は、サードパーティ製品の入手時に、サードパーティ サプライヤーが OSS 義務の履行に必要なすべての情報 (著作権告知、帰属告知、ライセンス文書、公開するべき対応ソースコードなど) を提供していることを保証する。

source: Please contact the Linux Foundation (http://training.linuxfoundation.org/contact/solutions) for more information.
ja: 詳細については、The Linux Foundation の Web サイト <http://training.linuxfoundation.org/contact/solutions> からお問い合わせください。

source: - Request FOSS compliance to be completed when receiving source code from outsourced development centers or third party software vendors
ja: 外注の開発センターやサードパーティ ソフトウェア ベンダーからソース コードを受け取る際、FOSS コンプライアンスの完了を要求する

source: - It helps manage acquisition of FOSS components
ja: FOSS コンポーネントの入手の管理に役立つ

source: This paper provided an overview of the changing business environment requiring a compliance program to ensure that companies honor the license obligations resulting from the use of proprietary, 3rd party commercial and FOSS components in their products.
ja: このペーパーでは、ビジネス環境が変化し、企業が自社製品にプロプライエタリなサード パーティの商用コンポーネントと FOSS コンポーネントを使用することから生じるライセンス義務を確実に履行するために、コンプライアンス プログラムが必要である、ということを簡単に説明しました。

source: After concluding the internal investigation (within acceptable time delays) through the review of the compliance due diligence completed for the specific software component (or product) in question, you need to provide the reporter with the results.
ja: 対象となるソフトウェア コンポーネント (または製品) に関するコンプライアンス精査のレビューを経て、社内調査完了後 (許容時間内に)、その結果を照会者に提供する必要があります。

source: The software is licensed under GPL and can be installed on any hardware meeting the minimum requirements.
ja: ソフトウェアは GPL のもとでライセンスされており、最低要件を満たしていれば、どのようなハードウェアにでもインストールできます。

source: More information can be found at http://www.linuxfoundation.org/programs/legal/compliance.
ja: 詳細については、下記のページをご覧ください。 http://www.linuxfoundation.org/programs/legal/compliance (英語) http://www.linuxfoundation.jp/programs/legal/compliance (日本語)

source: a) Proposed use of OSS includes a description of the architectural interfaces and dependencies between any OSS components and the rest of the system.
ja: a) OSS の使用案には、各 OSS コンポーネントとシステム全体との間のアーキテクチャ インタフェースおよび依存性の説明が含まれる。

source: The OSRB has approved the component’s usage in the product.
ja: OSRB が、対象コンポーネントを対象製品に使用することを承認している。

source: Components that are proprietary
ja: プロプライエタリなコンポーネント

source: If a new component was submitted and it does not correspond to an existing usage (FOSS request) form, then this means it is a new component and a new form must be filled out.
ja: 既存の FOSS 使用リクエスト フォームに対応していないコンポーネントが提出された場合、それは新規のコンポーネントを意味するため、新しいフォームに記入する必要があります。

source: Background
ja: 背景

source: Compliance Strategy
ja: コンプライアンス戦略

source: Linguistic review tool
ja: 言語レビュー ツール (Linguistic review tool)

source: To address that complexity, The Linux Foundation has developed a set of open source tools, training curricula and a new self-administered assessment checklist that will allow companies to ensure compliance in a cost-effective and efficient manner.
ja: こうした複雑化に対応するために、The Linux Foundation では、企業が効果的かつコスト効率よくコンプライアンスを徹底するためのツール、トレーニング コース、新しい自己診断チェックリストなどを開発しました。

source: Package Step
ja: パッケージ ステップ

source: - Appropriate notices have been provided in the product documentation, including attributions and copyright notices and perhaps, depending on the FOSS involved and the compliance approach, a written offer to provide source code upon request
ja: 製品の付随資料において、適切な告知が行われていること。この場合の適切な告知とは、帰属告知や著作権情報告知などですが、FOSS の種類に依存しており、要求があればソース コードを提供する「書面によるオファー」なども含まれます。

source: From time to time, compliance discussions have been impeded because copyright holders could not identify appropriate contact points within companies suspected of violating license conditions.
ja: 著作権所有者が、ライセンス違反の疑いがある企業の担当者を見つけられないために、コンプライアンスについて議論できないことがあります。

source: Process adoption progresses from initial process definition through institutionalization to a state of controlled process management.
ja: プロセスの導入は、初期のプロセスの定義から、制度化を経て、制御されたプロセス管理の状態へと進行する。

source: There is no need for the developers to obtain, install and maintain the toolchain directly locally on their system or in a virtual machine.
ja: 開発者は、自分のシステムや仮想マシンで、直接ローカルにそのツールチェーンを取得、インストール、およびメンテナンスする必要はありません。

source: We will discuss this topic, along with tools, in a separate future paper.
ja: このテーマと使用ツールについては、今後のホワイトペーパーで説明する予定です。

source: Ensuring that FOSS license obligations do not extend to proprietary software or third party software
ja: FOSS ライセンス義務がプロプライエタリ ソフトウェアやサードバーティのソフトウェアに及んでいないことを確認する

source: The goal of these seminars is to present and evoke discussions about the various aspects of incorporating FOSS in a commercial product.
ja: これらのセミナーの目的は、商品への FOSS の組み込みに関する多面的な議論を提示および喚起することです。

source: Policies and processes for using, contributing, distributing, auditing FOSS and for fulfilling license obligations
ja: FOSS の使用、貢献、配布、および監査と、ライセンス義務の履行に必要なポリシーとプロセス

source: The Linux Foundation Open Compliance Program Data Sheet
ja: The Linux Foundation オープン コンプライアンス プログラム データシート

source: Mandate engineers to disclose linkage method and list of linked components as part of the OSRB form.
ja: OSRB 文書としてリンク方法とリンク コンポーネント リストを技術者に公開させる。

source: In fact, a typical software package may consist of thousands of files with different licenses.
ja: 実際に、典型的なソフトウェア パッケージでも、異なるライセンスを持つ何千ものファイルで構成されているものがある。

source: Every check-in of a Package triggers and automatic rebuild of the Package and all Packages depending on it.
ja: あるパッケージをチェックインすると、そのパッケージと、それに依存するすべてのパッケージが自動的にリビルドされます。

source: These failures occur during the software development process when engineers add FOSS code into proprietary or 3rd party source code without having the necessary required approval from the OSRB.
ja: これらの違反は、ソフトウェアの開発過程で、技術者が本来必要な OSRB からの承認を受けずに、プロプライエタリ ソース コードやサード パーティのソース コードに FOSS コードを追加した場合に発生します。

source: Role of the OSRB
ja: OSRB の役割

source: The following paragraphs describe the three steps in a greatly simplified way to outline the process.
ja: では、3 つのステップについて、その処理の概要をごく簡単に説明します。

source: Strategy and inquiry response strategy
ja: コンプライアンス戦略と照会対応戦略

source: Conduct regular source code scanning all the source code in the code base to discover source code additions that do correspond to a compliance ticket7.
ja: すべてのソースコードにコード ベースで定期的にソース コード スキャン処理を実行し、コンプライアンス チケットに対応しているソース コードの追加状況を検出する。

source: Course ID
ja: コース ID

source: Using make and make scripting e.g. a makefile offers a better alternative and also provides additional features such as checking and automatically building dependencies, makedepend, and incremental building.
ja: 代わりに make や make スクリプト (makefile など) を使用してもよいでしょう。依存関係のチェックや自動ビルド、makedepend (依存関係の自動生成)、インクリメンタル ビルドなども行えるので便利です。

source: Other Useful Information
ja: その他の役立つ情報

source: Auditing source code is the second step in the compliance due diligence (Figure 3).
ja: ソース コードの監査は、コンプライアンス精査における第 2 ステップです (図 3)。

source: The Self-Assessment Checklist represents a key element of The Linux Foundation's Open Compliance Program, announced on August 10, 2010.
ja: 自己診断チェックリストは、2010 年 8 月 10 日に発表された The Linux Foundation オープン コンプライアンス プログラムの重要な要素です。

source: Schedulers
ja: スケジューラー

source: The Linux Foundation’s Open Compliance Program is the industry’s only neutral, comprehensive software compliance initiative.
ja: The Linux Foundation のオープン コンプライアンス プログラムは、業界唯一の中立かつ包括的なソフトウェア コンプライアンス構想です。

source: Suppliers, if they are cataloging the data at all, have their own formats and conventions.
ja: サプライヤーがすべてのデータを列挙しているとしても、彼ら独自のフォーマットや表記法を使用しています。

source: LF488:Implementation and Management of Open Source Compliance
ja: LF488:オープン ソース コンプライアンスの実行と管理

source: For More Information: Download the SPDX Overview
ja: 詳細情報: SPDX 概要をダウンロードする

source: At a minimum the obligatory Linux kernel is required and some additional packages providing core functionality after the kernel is initialized.
ja: 少なくとも Linux カーネルは必ず必要であり、その他に、カーネル初期化後のコア機能を提供する追加パッケージが含まれます。

source: Paper Organization and Background
ja: このホワイトペーパーの構成と背景

source: Please see http://www.linuxfoundation.org/programs/legal/compliance/training-and-education for course descriptions.
ja: コースの説明については、http://www.linuxfoundation.org/programs/legal/compliance/training-and-educationを参照してください。

source: Those companies further down the road can use the checklist to gauge their progress in implementing an effective compliance process and guide them in setting process improvement priorities.
ja: コンプライアンス プログラムについて経験を積んでいる企業は、このチェックリストを使用して、効果的なコンプライアンス プロセス実装の進捗を評価し、プロセス改善の優先順位づけに役立てることができます。

source: They need to know and document the components in the products and software they are consuming and distributing for a variety of reasons, not the least of which is to make sure they understand their legal obligations.
ja: 企業は、さまざまな理由で利用したり配布したりしている製品やソフトウェア内のコンポーネントを認識し、文書化する必要がありますが、その中でもとりわけ、法的義務を確実に理解することが重要です。

source: SPDX Overview
ja: SPDX 概要 (英語)

source: The next paper is this series will examine a detailed compliance process from software intake phase to releasing a product.
ja: このシリーズの第四弾のホワイト ペーパーでは、ソフトウェアの採用から製品リリースに至るまでの詳細なコンプライアンス プロセスについて分析します。

source: - FOSS used in the product has been identified, reviewed and approved
ja: 製品で使用されている FOSS の検出、調査、および承認が完了していること

source: g)Records of OSRB deliberations are maintained (cases, status, past decisions, requirements imposed on product teams, etc.)
ja: g) 今後の審議での使用に備えて、OSRB 審議記録 (事例、状況、過去の決定、製品担当チームに課せられた要件など) を維持管理する。

source: In some instances, companies may not inform users on how they can obtain the source code for software packages included in the product.
ja: 企業によっては、製品に含まれるソフトウェア パッケージのソース コードの入手方法をユーザーに知らせない場合があります。

source: - Compliance Publications: http://www.linuxfoundation.org/publications
ja: コンプライアンス関連のホワイトペーパー: http://www.linuxfoundation.jp/publications/compliance

source: In order to fulfill documentation obligations, appropriate notices must be included with the product.
ja: ドキュメント記載義務を履行するには、製品に適切な告知を含める必要があります。

source: Course Outline
ja: コース概要

source: Kate Stewart has just joined Canonical as the Ubuntu Release Manager.
ja: Kate Stewart は、Ubuntu のリリース マネージャーとして Canonical に入社しました。

source: Details are in the resources section.
ja: 詳細については、リソースのセクションを参照してください。

source: Most companies have well-established practices that govern the release and distribution of software.
ja: 多くの企業は、確立されたプラクティスによって、ソフトウェアのリリースと配布を管理しています。

source: - Source code downloaded from the web (unknown author or license)
ja: Web からソース コードをダウンロードした (作者やライセンスは不明)

source: This type of failure can be is discovered using a dependency tracking tool12 that allows you to discover linkages between different software components.
ja: このタイプの違反は、ソフトウェア コンポーネント間のリンク状態がわかる「依存状態追跡」ツールを使用して検出できる。

source: b)The compliance support team has access to functional specialties to guide or perform compliance activities, e.g. OSRB, documentation production, IT, etc.
ja: b) コンプライアンス サポート チームは、コンプライアンス作業を指導または実行するために、OSRB、ドキュメンテーション作成、IT などの業務専門家にアクセスできること。

source: Breaking down information silos is still a work in progress.
ja: また、情報集約の方法についても、現在作業が進められています。

source: This paper provides basic discussion on the following topics:
ja: この文書では、次のようなテーマについて基本的な考察を行います。

source: The fact that it is open-source and freely available is an added bonus lowering the barrier of entrance.
ja: さらに、オープンソースであり、自由に利用できるため、導入時の垣根が低くなります。

source: Open Source Compliance
ja: オープン ソース コンプライアンス

source: You must avoid requiring engineers to spend more time than necessary on compliance activities.
ja: 技術者がコンプライアンス活動で必要以上に時間を費やすことは、避けなければなりません。

source: The organization periodically reviews commercial and open source tools to assess the costs and benefits of their use in discovering OSS in code baselines.
ja: 組織は、商用およびオープン ソース ツールを定期的に調査し、それらをコード ベースラインの OSS 検出に使用する際のコストとメリットを評価する。

source: Adaptation of Business Processes
ja: ビジネス プロセスの適応◆◆

source: In the following sub-sections we describe briefly these tools and how they contribute to the compliance activities.
ja: これらのツールとその働きについて、これから簡単に説明します。

source: Mandate that for a FOSS to be accepted into the build system, it must have a corresponding OSRB form.
ja: ビルド システムが FOSS を受け入れるためには、対応する OSRB 文書が必要となるようにする。

source: Continuous Integration
ja: 継続的な統合

source: About the Open Compliance Program
ja: オープン コンプライアンス プログラムについて

source: The release engineers have the discretion to accept, reject, or queue submitted changes to ensure the usability of the upcoming release for the MeeGo user community.
ja: リリース エンジニアは、MeeGo ユーザー コミュニティにとって次期リリースが確実に有用なものとなるように、提出された変更箇所の承認、許可、または待機を決定します。

source: Early submission and review of OSRB usage forms
ja: OSRB 使用申請書の迅速な提出とレビューを実行する

source: The tools developed by The Linux Foundation that are described below are licensed under the MIT license.
ja: The Linux Foundation によって開発された下記のツールは、MIT ライセンスの下でライセンスされています。

source: For more information, please visit?http://www.linuxfoundation.org?or follow the organization on Twitter at?http://www.twitter.com/linuxfoundation.
ja: The Linux Foundation の詳細については、http://www.linuxfoundation.org (英語) または http://www.linuxfoundation.jp (日本語) を参照してください。また、ツイッターで http://www.twitter.com/linuxfoundation および http://twitter.com/LinuxJapan をフォローしてください。

source: Element of a Compliance Program
ja: コンプライアンス プログラムの要素

source: According to The Economist, 5/28/2009, “The argument has been won.
ja: お2009 年 5 月 28 日付のエコノミスト紙は、「オープンソースは議論に勝った。

source: External consultants are hired, as needed, to augment the internal compliance effort.
ja: 必要に応じて外部のコンサルタントを採用し、社内のコンプライアンス活動を強化する。

source: Since it is always a recommended practice to separate FOSS, company-developed proprietary software and third party software in different folders in your build system, it becomes feasible to set up alerts when new code is being submitted.
ja: 「FOSS」、「自社開発のプロプライエタリ ソフトウェア」、「サード パーティ ソフトウェア」をビルド システム内の異なるフォルダーに分類しておき、それぞれに新しいコードが提出されると警告されるように設定することができます。

source: Individual contributions
ja: 個人の貢献

source: The goal is to determine if any FOSS obligations are extending to proprietary or third party software components.
ja: これにより、プロプライエタリ ソフトウェア コンポーネントやサード パーティ ソフトウェア コンポーネントに、何らかの FOSS 義務が及んでいるかどうかがわかります。

source: Source code has been audited and all issues have been resolved.
ja: ソース コードの監査が完了し、すべての問題が解決されている。

source: Of course, the developer must provide the source files, in general C/C++ source and header files, as the input.
ja: 当然ですが、開発者は、入力データであるソースファイルを用意する必要があります。通常は C または C++ のソースおよびヘッダー ファイルです。

source: Scalability ?
ja: スケーラビリティ

source: Lightweight Policies and Processes
ja: 軽量なポリシーとプロセス

source: The most secure way to enable this operation is to provide a set of EFI tools for managing the signature database that would allow the user to validate the install media, extract the OS Vendor KEK from it and install it into the database.
ja: 最も安全な方法は、署名データベースを管理するための EFI ツールセットを用意することです。これによって、ユーザーがインストール メディアを認証し、そこから OS ベンダーの鍵交換鍵を取り出し、署名データベースにインストールすることが可能になります。

source: - Corresponds to the same version that was approved
ja: 承認されたバージョンに対応したものであること

source: It allows the discovery of compliance problems as they occur.
ja: コンプライアンス問題を即時に発見できる。

source: Download Location
ja: ダウンロード場所

source: Component dependencies
ja: コンポーネントの依存状態

source: Anyone involved in bringing software into the organization and anyone involved in developing and distributing products or interfacing with customers, including
ja: 組織のソフトウェア採用に関わるすべての人、製品の開発や配布に関わるすべての人、あるいは顧客とやりとりするすべての人。たとえば、以下のような職責や部門に属する人々です。

source: Disclosure obligationto be imposed
ja: 課されるべき開示義務

source: Multi-distribution Support
ja: マルチディストリビューション サポート

source: Example of a modification notice:
ja: 修正告知の例:

source: In the following sub-sections, we provide some of the recommended practices related to processing compliance requests.
ja: 以下のセクションでは、FOSS 利用要求に対応するための推奨プラクティスをいくつか紹介します。
